{
    "intro": "Welcome to Fate Hardin's Portfolio.",
    "aboutMe": "My name is Fate Hardin, and I am currently spending my time learning guitar, yoyo-ing, and staying up to date in the world of technology. I enjoy reading and talking about astrophysics, music, philosophy, and video games. \n\nSince I was young I have always had an interest in science. My parents being teachers, I was learning from a young age about the beauty and complexity of the universe. This encouraged my interest in astrophysics and math, our ways of understanding our reality that make up that universe. \n\nIn college I majored in computer science, earning a Bachelor's of Science. There, I got my first experience programming and enjoyed participating in the International Collegiate Programming Contest. Since then, I have been working on software projects that build my development expertise to higher levels. \n\nIn addition to programming, I spend my days practicing my guitar chops and working on my yoyo skills - two hobbies I never see going away.",
    "contactInfo": {
        "email": "laf8hardin@gmail.com",
        "github": "https://github.com/F8Hardin"
    },
    "projects": {
        "personalProjects": [
            {
                "name": "Email AI Assistant",
                "description": "I built an electron application that uses a LangChain agent with OpenAI and custom defined tools to interact with my personal email. With this application, the agent can read my emails, classify them, summarize them, as well as find important information from the available emails. In the future, I would improve the functionality by integrating a vector database for email storage and retrieval, as well as support for many users.",
                "stack": ["OpenAI", "Langchain", "Electron JS", "Socket IO"]
            },
            {
                "name": "Video To Notes Workflow",
                "description": "This project involved building a react front end messaging system that allowed a user to send a public youtube playlist URL to the backend and receive back notes about the videos in the playlist.",
                "stack": ["LM Studio with LLama 3.1", "React JS", "Socket IO", "Whisper C++", "FFMPEG"],
                "relatedURLs": {
                    "LinkedIn Post": "https://www.linkedin.com/feed/update/urn:li:activity:7334321072432947201/"
                }
            },
            {
                "name": "Hand to Mouse Controls",
                "description": "For this project, I trained a CNN using Keras to recognize specific handgestures using data generated by MediaPipe's hand tracking solution. This allowed me to trigger left clicks, right clicks, and move the mouse with my hand.",
                "stack": ["Python", "OpenCV", "MediaPipe", "Tensorflow", "PyAutoGUI"],
                "relatedURLs": {
                    "Kaggle Notebook": "https://www.kaggle.com/code/fatehardin/hand-pose-recognition",
                    "Github": "https://github.com/F8Hardin/Hand-Mouse-Controls"
                }
            },
            {
                "name": "Personal Ubuntu Server",
                "description": "I have a personal home server to act as a cloud drive and media storage center. Using wireguard with my server, I can remotely access it anywhere via a secure connection. Currently, my server hosts Jellyfin for media access, Samba for drive access, and runs iCloudPd to backup my icloud photos to a large storage drive.",
                "stack": ["Wireguard", "Jellyfin", "Samba"]
            }
        ],
        "professionalProjects": [
            {
                "name": "Magic Leap Omniverse AR Plugin",
                "description": "This project involved developing a custom extension for NVidia Omniverse. This extension enabled world building with the use of the Magic Leap AR Headset, allowing the user to build and view 3D assets in the HMD via remote rendering. This involved understanding linear algebra in order for objects to be manipulated properly in 3D space around the AR user.",
                "stack": ["NVidia Omniverse", "Python", "MagicLeap 2"],
                "relatedURLs": {
                    "Magic Leap Documentation": "https://developer-docs.magicleap.cloud/docs/guides/remote-rendering/Applications/Omniverse/omniverse-setup/"
                },
                "images": {
                    "Starting XR": "/images/mlstart.png",
                    "Cube Example": "/images/cubeExample.png"
                }
            },
            {
                "name": "Ultimate Medical Academy: Bias In Recruiting (Unreal Engine)",
                "description": "The \"UMA : Bias In Recruiting\" VR application provided users with an empathetic first person shooter experience. Each player chose a character with a certain bias placed upon them. This bias would give the player an advantage or weakness during gameplay. The goal of this project was to help users overcome internal bias during the hiring process. My work on this project involved working with the AWS gamelift servers for multiplayer, as well as working with C++ and Blueprint actors for in game functionality.",
                "stack": ["Unreal Engine 4", "Meta Quest", "AWS Gamelift", "AWS Cognito"],
                "relatedURLs": {
                    "Related News Article": "https://www.bizjournals.com/tampabay/inno/stories/profiles/2022/05/24/clearwater-company-uses-vr-hiring-bias.html"
                },
                "images": {
                    "Bow Weapon POV": "/images/uma.png"
                }
            },
            {
                "name": "DOD Experience (Full Stack)",
                "description": "Key Contributor to a $4M+ Department of Defense Spatial Computing platform, developing Cloud XR clients and an Electron-based monitoring system. I managed EC2 auto scaling groups, AMIs, and launch templates to automate Virtual Machine deployment and scaling. In addition, I developed and maintained a React Web Client, ensuring seamless integration with an Electron Client through a Socket.IO based client-server messaging system.",
                "stack": ["React JS", "Unreal Engine 5", "AWS EC2", "CloudXR", "HTC XR Elite"],
                "relatedURLs": {
                    "Related News Article": "https://www.accessnewswire.com/newsroom/en/computers-technology-and-internet/brightline-interactive-enters-into-a-4-million-contract-with-a-dep-862785"
                }
            },
            {
                "name": "IVXHealth Adverse Reactions Simulation (Unreal Engine)",
                "description": "The IVX Health VR application was built to train employees at the IVX Health facility. This simulation focused performing procedures properly for the giving of intravanous medicine. My work on this project included developing the user interfaces and inventory system, as well as creating additional C++ and Blueprint actors for users to interact with while completing the simulation.",
                "stack": ["Unreal Engine 4", "Meta Quest"],
                "videos": {
                    "Showcase" : "/videos/IVXDemo.mp4"
                }
            }
        ]
    }
}
