{
    "intro" : "Welcome to Fate Hardin's Portfolio.",
    "aboutMe" : "My name is Fate Hardin, and I am currently spending my time learning guitar, yoyo-ing, and staying up to date in the world of technology. I enjoy reading and talking about astrophysics, music, philosophy, and video games. \n\nSince I was young I have always had an interest in science. My parents being teachers, I was learning from a young age about the beauty and complexity of the universe. This encouraged my interest in astrophysics and math, our ways of understanding our reality that make up that universe. \n\nIn college I majored in computer science, earning a Bachelor's of Science. There, I got my first experience programming and enjoyed participating in the International Collegiate Programming Contest. Since then, I have been working on software projects that build my development expertise to higher levels. \n\nIn addition to programming, I spend my days practicing my guitar chops and working on my yoyo skills - two hobbies I never see going away.",
    "contactInfo" : {
        "email" : "laf8hardin@gmail.com",
        "github" : "https://github.com/F8Hardin"
    },
    "projects" : {
        "personalProjects" : [
            {
                "name" : "Email AI Assistant",
                "description" : "I built an electron application that uses a LangChain agent with OpenAI and custom defined tools to interact with my personal email. With this application, the agent can read my emails, classify them, summarize them, as well as find important information from the available emails. In the future, I would improve the functionality by integrating a vector database for email storage and retrieval, as well as support for many users.",
                "stack" : "OpenAI, Langchain, Electron JS, Socket IO",
                "images" : []
            },
            {
                "name" : "Video To Notes Workflow",
                "description" : "This project involved building a react front end messaging system that allowed a user to send a public youtube playlist URL to the backend and receive back notes about the videos in the playlist.",
                "stack" : "LM Studio with LLama 3.1, React JS, Socket IO, Whisper C++, FFMPEG",
                "images" : []
            },
            {
                "name" : "Hand to Mouse Controls",
                "description" : "More details coming soon.",
                "stack" : "Python, OpenCV, MediaPipe, Tensorflow, PyAutoGUI",
                "images" : []
            },
            {
                "name" : "Personal Ubuntu Server",
                "description" : "A personal home server to act as a personal cloud drive and media storage center.",
                "stack" : "Wireguard, Jellyfin, Samba",
                "images" : []
            }
        ],
        "professionalProjects" : [
            {
                "name" : "Magic Leap Omniverse AR Plugin",
                "description" : "This project involved developing a custom extension for NVidia Omniverse. This extension enabled world building with the use of the Magic Leap AR Headset, allowing the user to build and view 3D assets in the HMD via remote rendering.",
                "stack" : "NVidia Omniverse, Python, MagicLeap 2",
                "relatedURLs" : {
                    "Magic Leap Documentation" : "https://developer-docs.magicleap.cloud/docs/guides/remote-rendering/Applications/Omniverse/omniverse-setup/"
                },
                "images" : []
            },
            {
                "name" : "Ultimate Medical Academy: Bias In Recruiting",
                "description" : "More details coming soon.",
                "stack" : "Unreal Engine 4, Meta Quest, AWS Gamelift, AWS Cognito",
                "images" : []
            },
            {
                "name" : "DOD Experience",
                "description" : "More details coming soon.",
                "stack" : "React JS, Unreal Engine 5, AWS EC2, HTC XR Elite",
                "relatedURLs" : {
                    "Related News Article" : "https://www.accessnewswire.com/newsroom/en/computers-technology-and-internet/brightline-interactive-enters-into-a-4-million-contract-with-a-dep-862785"
                },
                "images" : []
            },
            {
                "name" : "IVXHealth",
                "description" : "More details coming soon.",
                "stack" : "Unreal Engine 4, Meta Quest",
                "images" : []
            }
        ]
    }
}